---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.FunctionId
source: html/1e64223d-e657-e079-6767-292d2dfef5df.htm
---
# FunctionId Methods

Retrieves data needed to serialize the target object.